vehar/Stm32flash_uC_port/flasher_stm32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
I2C_HandleTypeDef hi2c1;

UART_HandleTypeDef huart1;

#include <sys/types.h>
#include <sys/stat.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <string.h>
#include <signal.h>
#include <stdarg.h>

#include "utils.h"
#include "stm32.h"
#include "port.h"


/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define VERSION "0.7"
#define intSize 4
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;

UART_HandleTypeDef huart1;

/* USER CODE BEGIN PV */
/* device globals */
stm32_t	*stm = NULL;
struct port_interface *port = NULL;

/* settings */
struct port_options port_opts = {
    .device = NULL,
    .serial_mode = "8e1",
    .bus_addr = 0,
    .rx_frame_max = STM32_MAX_RX_FRAME,
    .tx_frame_max = STM32_MAX_TX_FRAME,
};

enum actions {
    ACT_NONE,
    ACT_READ,
    ACT_WRITE,
    ACT_WRITE_UNPROTECT,
    ACT_READ_PROTECT,
    ACT_READ_UNPROTECT,
    ACT_ERASE_ONLY,
    ACT_CRC
};

enum actions action = ACT_NONE;
int npages = 0;
int spage = 0;
int no_erase = 0;
char verify = 0;
int retry = 10;
char exec_flag = 0;
uint32_t execute = 0;
char init_flag = 1;
int use_stdinout = 0;
char force_binary = 0;
FILE *diag;
char reset_flag = 0;
char *filename;
char *gpio_seq = NULL;
uint32_t start_addr = 0;
uint32_t readwrite_len = 0;


/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART1_UART_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* redirect printf to UART */
int _write(int fd, char* ptr, int len) {
    HAL_UART_Transmit(&huart1, (uint8_t *) ptr, len, HAL_MAX_DELAY);
    return len;
}

/* redirect fprintf to UART (for compatibility with stm32flash code) */
int my_fprintf(FILE *stream, const char *format, ...) {
    va_list	listp;
    va_start(listp, format);
    int ret = vprintf(format, listp);
    va_end(listp);
    return ret;
}
#define fprintf my_fprintf


static int is_addr_in_ram(uint32_t addr)
{
    return addr >= stm->dev->ram_start && addr < stm->dev->ram_end;
}

static int is_addr_in_flash(uint32_t addr)
{
    return addr >= stm->dev->fl_start && addr < stm->dev->fl_end;
}

static int is_addr_in_opt_bytes(uint32_t addr)
{
    /* option bytes upper range is inclusive in our device table */
    return addr >= stm->dev->opt_start && addr <= stm->dev->opt_end;
}

static int is_addr_in_sysmem(uint32_t addr)
{
    return addr >= stm->dev->mem_start && addr < stm->dev->mem_end;
}

/* returns the page that contains address "addr" */
static int flash_addr_to_page_floor(uint32_t addr)
{
    int page;
    uint32_t *psize;

    if (!is_addr_in_flash(addr))
        return 0;

    page = 0;
    addr -= stm->dev->fl_start;
    psize = stm->dev->fl_ps;

    while (addr >= psize[0]) {
        addr -= psize[0];
        page++;
        if (psize[1])
            psize++;
    }

    return page;
}

/* returns the first page whose start addr is >= "addr" */
int flash_addr_to_page_ceil(uint32_t addr)
{
    int page;
    uint32_t *psize;

    if (!(addr >= stm->dev->fl_start && addr <= stm->dev->fl_end))
        return 0;

    page = 0;
    addr -= stm->dev->fl_start;
    psize = stm->dev->fl_ps;

    while (addr >= psize[0]) {
        addr -= psize[0];
        page++;
        if (psize[1])
            psize++;
    }

    return addr ? page + 1 : page;
}

/* returns the lower address of flash page "page" */
static uint32_t flash_page_to_addr(int page)
{
    int i;
    uint32_t addr, *psize;

    addr = stm->dev->fl_start;
    psize = stm->dev->fl_ps;

    for (i = 0; i < page; i++) {
        addr += psize[0];
        if (psize[1])
            psize++;
    }

    return addr;
}

/* i2c address scanner, returns single value - first found address*/
uint8_t Buffer[25] = {0};
uint8_t Space[] = " - ";
uint8_t StartMSG[] = "Starting I2C Scanning: \n";
uint8_t EndMSG[] = "Done! \n\n";

unsigned long int scan_i2c_address() {

    uint8_t i=0, ret;

    fprintf(stdout, "%s", StartMSG);

    /* check all possible addresses */
    for(i=1; i<128; i++)
    {
        ret = HAL_I2C_IsDeviceReady(&hi2c1, (uint16_t)(i<<1), 3, 5);
        if (ret != HAL_OK) /* No ACK Received At That Address */
        {
            fprintf(stdout, "%s", Space);
        }
        else if(ret == HAL_OK)
        {
            sprintf(Buffer, "0x%X", i);
            fprintf(stdout, "%s\n", Buffer);
            return i; 
        }
        
        /* format output */
        if (i % 16 == 0) {
            fprintf(stdout, "\n");
        }
    }
    fprintf(stdout, "%s", EndMSG);
    return 0;
}


/* buffer to receive commands and file size via UART */
uint8_t Rx_data[intSize+2];


/* reconstruct received bytes to uint32_t */
uint32_t convertToInt(uint8_t bytesBuf[intSize+2]) {
	uint32_t retValue = (uint32_t)bytesBuf[0]
						+ (uint32_t)(bytesBuf[1] << 8)
						+ (uint32_t)(bytesBuf[2] << 16)
						+ (uint32_t)(bytesBuf[3] << 24);

	return retValue;
}



