vehar/Stm32flash_uC_port/flasher_stm32/Core/Src/main.c
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_I2C1_Init();
  MX_USART1_UART_Init();
  /* USER CODE BEGIN 2 */

    while (1) {
        HAL_Delay(1000);


        int ret = 1;
        stm32_err_t s_err;
        diag = stdout;

        /* wait for command to be sent */
        printf("waiting for command\n");
        while(HAL_UART_Receive(&huart1, Rx_data, 1, 100) == HAL_TIMEOUT);

        /*  TODO: For now program won't start on its own - you should send 1 to uart
            TODO: to start scan address then stm32f401 will exit bootloader and it should be reentered
            TODO: to continue you can enter 2 */
        if (Rx_data[0] == '1') {
            port_opts.bus_addr = scan_i2c_address(); /* address of i2c slave */
            
            /* if address is 0 means no address was found */
            if (port_opts.bus_addr==0) {
                printf("Wrong address!\n");
                continue;
            }
        }

        if (Rx_data[0] == '2') {
            action =  ACT_WRITE;

            /* execute program after flashing - can be changed */
            exec_flag = 1;
            execute = 0x0; /* 0 means flash start */
            if (execute % 4 != 0) {
                fprintf(stderr, "ERROR: Execution address must be word-aligned\n");
                return 1;
            }

            port_opts.device = "/dev/i2c-8"; /* dummy else it can break */

            /* TODO: Rx Tx max length (used in i2c as read/write length respectively)
               TODO: this is working for stm32f401 and stm32f746 but can be different for other boards */
            port_opts.rx_frame_max = 255; /* not default 256 */
            port_opts.tx_frame_max = 128; /* not default 256 */


            /* not really needed but leaving just in case */
            if (port_opts.rx_frame_max < 0
                || port_opts.tx_frame_max < 0) {
                fprintf(stderr, "ERROR: Invalid negative value for option -F\n");
                return 1;
            }
            if (port_opts.rx_frame_max == 0)
                port_opts.rx_frame_max = STM32_MAX_RX_FRAME;
            if (port_opts.tx_frame_max == 0)
                port_opts.tx_frame_max = STM32_MAX_TX_FRAME;
            if (port_opts.rx_frame_max < 20
                || port_opts.tx_frame_max < 6) {
                fprintf(stderr, "ERROR: current code cannot work with small frames.\n");
                fprintf(stderr, "min(RX) = 20, min(TX) = 6\n");
                return 1;
            }
            if (port_opts.rx_frame_max > STM32_MAX_RX_FRAME) {
                fprintf(stderr, "WARNING: Ignore RX length in option -F\n");
                port_opts.rx_frame_max = STM32_MAX_RX_FRAME;
            }
            if (port_opts.tx_frame_max > STM32_MAX_TX_FRAME) {
                fprintf(stderr, "WARNING: Ignore TX length in option -F\n");
                port_opts.tx_frame_max = STM32_MAX_TX_FRAME;
            }


            if (action == ACT_READ && use_stdinout) {
                diag = stderr;
            }

            /* output info about board to be flashed */

            fprintf(diag, "stm32flash " VERSION "\n\n");
            fprintf(diag, "http://stm32flash.sourceforge.net/\n\n");


            if (port_open(&port_opts, &port) != PORT_ERR_OK) {
                fprintf(stderr, "Failed to open port: %s\n", port_opts.device);
                goto close;
            }

            fprintf(diag, "Interface %s: %s\n", port->name, port->get_cfg_str(port));

            port->flush(port);

            stm = stm32_init(port, init_flag);
            if (!stm)
                goto close;

            fprintf(diag, "Version      : 0x%02x\n", stm->bl_version);
            if (port->flags & PORT_GVR_ETX) {
                fprintf(diag, "Option 1     : 0x%02x\n", stm->option1);
                fprintf(diag, "Option 2     : 0x%02x\n", stm->option2);
            }
            fprintf(diag, "Device ID    : 0x%04x (%s)\n", stm->pid, stm->dev->name);
            fprintf(diag, "- RAM        : Up to %dKiB  (%db reserved by bootloader)\n", (stm->dev->ram_end - 0x20000000) / 1024, stm->dev->ram_start - 0x20000000);
            fprintf(diag, "- Flash      : Up to %dKiB (size first sector: %dx%d)\n", (stm->dev->fl_end - stm->dev->fl_start ) / 1024, stm->dev->fl_pps, stm->dev->fl_ps[0]);
            fprintf(diag, "- Option RAM : %db\n", stm->dev->opt_end - stm->dev->opt_start + 1);
            fprintf(diag, "- System RAM : %dKiB\n", (stm->dev->mem_end - stm->dev->mem_start) / 1024);

            uint8_t	buffer[256];  /* max possible chunk to flash */
            uint32_t addr, start, end;
            unsigned int len;
            int	failed = 0;
            int	first_page, num_pages;

            /*
            * Cleanup addresses:
            *
            * Starting from options
            *	start_addr, readwrite_len, spage, npages
            * and using device memory size, compute
            *	start, end, first_page, num_pages
            */


            if (start_addr || readwrite_len) {
                if (start_addr == 0)
                    /* default */
                    start = stm->dev->fl_start;
                else if (start_addr == 1)
                    /* if specified to be 0 by user */
                    start = 0;
                else
                    start = start_addr;

                if (is_addr_in_flash(start))
                    end = stm->dev->fl_end;
                else {
                    no_erase = 1;
                    if (is_addr_in_ram(start))
                        end = stm->dev->ram_end;
                    else if (is_addr_in_opt_bytes(start))
                        end = stm->dev->opt_end + 1;
                    else if (is_addr_in_sysmem(start))
                        end = stm->dev->mem_end;
                    else {
                        /* Unknown territory */
                        if (readwrite_len)
                            end = start + readwrite_len;
                        else
                            end = start + sizeof(uint32_t);
                    }
                }

                if (readwrite_len && (end > start + readwrite_len))
                    end = start + readwrite_len;

                first_page = flash_addr_to_page_floor(start);
                if (!first_page && end == stm->dev->fl_end)
                    num_pages = STM32_MASS_ERASE;
                else
                    num_pages = flash_addr_to_page_ceil(end) - first_page;
            } else if (!spage && !npages) {
                start = stm->dev->fl_start;
                end = stm->dev->fl_end;
                first_page = 0;
                num_pages = STM32_MASS_ERASE;
            } else {
                first_page = spage;
                start = flash_page_to_addr(first_page);
                if (start > stm->dev->fl_end) {
                    fprintf(stderr, "Address range exceeds flash size.\n");
                    goto close;
                }

