vehar/Stm32flash_uC_port/flasher_stm32/Core/Src/main.c
                if (npages) {
                    num_pages = npages;
                    end = flash_page_to_addr(first_page + num_pages);
                    if (end > stm->dev->fl_end)
                        end = stm->dev->fl_end;
                } else {
                    end = stm->dev->fl_end;
                    num_pages = flash_addr_to_page_ceil(end) - first_page;
                }

                if (!first_page && end == stm->dev->fl_end)
                    num_pages = STM32_MASS_ERASE;
            }

                /* start writing to memory */

                fprintf(diag, "Write to memory\n");

                unsigned int offset = 0;
                unsigned int r;
                unsigned int size;
                unsigned int max_wlen, max_rlen;

                max_wlen = port_opts.tx_frame_max - 2;	/* skip len and crc */
                max_wlen &= ~3;	/* 32 bit aligned */

                max_rlen = port_opts.rx_frame_max;
                max_rlen = max_rlen < max_wlen ? max_rlen : max_wlen;

                /* Assume data from stdin is whole device */
                if (use_stdinout)
                    size = end - start;
                else {
                    printf("Receive size:\n");
                    while(HAL_UART_Receive(&huart1, Rx_data, intSize, 1000) == HAL_TIMEOUT);

                    size = convertToInt(Rx_data);
                    printf("Size received: %d\n", size);

                }

                /* TODO: It is possible to write to non-page boundaries, by reading out flash
                        from partial pages and combining with the input data
                if ((start % stm->dev->fl_ps[i]) != 0 || (end % stm->dev->fl_ps[i]) != 0) {
                    fprintf(stderr, "Specified start & length are invalid (must be page aligned)\n");
                    goto close;
                }

                TODO: If writes are not page aligned, we should probably read out existing flash
                        contents first, so it can be preserved and combined with new data */

                /* erase memory before flushing */
                if (!no_erase && num_pages) {
                    fprintf(diag, "Erasing memory\n");
                    s_err = stm32_erase_memory(stm, first_page, num_pages);
                    if (s_err != STM32_ERR_OK) {
                        fprintf(stderr, "Failed to erase memory\n");
                        goto close;
                    }
                }

                fflush(diag);

                addr = start;
                while(addr < end && offset < size) {
                    uint32_t left	= end - addr;
                    len		= max_wlen > left ? left : max_wlen;
                    len		= len > size - offset ? size - offset : len;
                    unsigned int reqlen = len ;


                    /* receive len number of bytes from binary file */
                    printf("Ready to receive portion of data\n");
                    while(HAL_UART_Receive(&huart1, buffer, len, HAL_MAX_DELAY) == HAL_TIMEOUT);
                    printf("Received portion of data\n");

                    if (len == 0) {
                        if (use_stdinout) {
                            break;
                        } else {
                            fprintf(stderr, "Failed to read input file\n");
                            goto close;
                        }
                    }

                    again:
                    s_err = stm32_write_memory(stm, addr, buffer, len);
                    if (s_err != STM32_ERR_OK) {
                        fprintf(stderr, "Failed to write memory at address 0x%08x\n", addr);
                        goto close;
                    }

                    if (verify) {
                        uint8_t compare[len];
                        unsigned int offset, rlen;

                        offset = 0;
                        while (offset < len) {
                            rlen = len - offset;
                            rlen = rlen < max_rlen ? rlen : max_rlen;
                            s_err = stm32_read_memory(stm, addr + offset, compare + offset, rlen);
                            if (s_err != STM32_ERR_OK) {
                                fprintf(stderr, "Failed to read memory at address 0x%08x\n", addr + offset);
                                goto close;
                            }
                            offset += rlen;
                        }

                        for(r = 0; r < len; ++r)
                            if (buffer[r] != compare[r]) {
                                if (failed == retry) {
                                    fprintf(stderr, "Failed to verify at address 0x%08x, expected 0x%02x and found 0x%02x\n",
                                        (uint32_t)(addr + r),
                                        buffer [r],
                                        compare[r]
                                    );
                                    goto close;
                                }
                                ++failed;
                                goto again;
                            }

                        failed = 0;
                    }

                    addr	+= len;
                    offset	+= len;

                    fprintf(diag,
                        "\rWrote %saddress 0x%08x\n",
                        verify ? "and verified " : "",
                        addr
                    );
                    fflush(diag);

                    if( len < reqlen)	/* Last read already reached EOF */
                        break ;
                }

                fprintf(diag, "Done.\n");
                ret = 0;
                goto close;


        close:
            /* start execution of flashed code */
            if (stm && exec_flag && ret == 0) {
                if (execute == 0)
                    execute = stm->dev->fl_start;

                fprintf(diag, "\nStarting execution at address 0x%08x... ", execute);
                fflush(diag);
                if (stm32_go(stm, execute) == STM32_ERR_OK) {
                    reset_flag = 0;
                    fprintf(diag, "done.\n");
                } else
                    fprintf(diag, "failed.\n");
            }

            if (stm)
                stm32_close(stm);

